# import pymysql

# pymysql.install_as_MySQLdb()

# db = pymysql.connect(host='localhost',
#                      port = 3306,
#                      user = 'haegu',
#                      passwd = '950713',
#                      db = 'test_db',
#                      charset='utf8')
# cursor = db.cursor()

# # 읽을 파일 날짜명
DATE = "210827"
DATA = {}
data_str =  """('나로',133,1326,4,4,1298),('나워',17,169,35,35,167),('다크나이트',35,343,26,24,335),('데벤',40,398,21,20,395),('데슬',31,301,31,31,296),('듀블',221,2202,1,1,2140),('루미',38,375,22,22,362),('메르',42,412,19,19,403),('메카',21,202,34,34,195),('미하일',7,66,44,43,65),('바이퍼',41,407,20,21,393),('배메',13,128,37,37,127),('보마',23,229,33,33,225),('불독',114,1136,5,5,1144),('블래',12,112,41,41,108),('비숍',140,1395,3,3,1355),('섀도어',92,911,8,8,889),('소마',36,351,24,25,335),('스커',13,123,40,39,121),('신궁',13,123,39,38,123),('썬콜',105,1043,6,6,997),('아델',169,1680,2,2,1581),('아란',50,498,17,17,494),('아크',88,879,9,9,855),('에반',49,484,18,18,476),('엔버',86,853,10,11,829),('와헌',16,150,36,36,146),('윈브',63,629,16,16,618),('은월',86,852,11,10,834),('일리움',9,89,42,42,87),('제논',34,337,28,26,333),('제로',66,654,15,15,639),('카데나',31,302,30,30,299),('카이저',28,275,32,32,267),('카인',7,68,43,44,62),('캐슈',67,669,13,13,654),('캡틴',13,125,38,40,118),('키네',35,345,25,27,333),('팔라딘',34,339,27,23,340),('패파',102,1014,7,7,985),('팬텀',72,717,12,12,693),('플위',33,329,29,29,324),('호영',37,361,23,28,330),('히어로',67,664,14,14,646)"""

string = data_str.split("),(")

for index, mini_str in enumerate(string):
    if index == 0:
        mini_str = mini_str.replace("(", "")
    if index == len(string) - 1:
        mini_str = mini_str.replace(")", "")
    mini_str = mini_str.replace("'", "")
    data_list = mini_str.split(',')
    for i, v in enumerate(data_list):
        if i != 0:
            data_list[i] = int(v)
    DATA[data_list[0]] = data_list[1:]

print(DATA)
# # file 읽기
# print(DATE + ".sql 를 읽습니다.")
# sql = open(DATE + ".sql").read()


# cursor.execute(sql)
# cursor.fetchall()

# db.close()